var rl4Tips = [
    "我是tip,不是新闻条,别总盯着我",
    "我为什么不动?谁想像上边那新闻条一样一直干活啊",
    "小知识:塌缩和镜面的公式都差不多是x^[1/lg(req)]/10,唯一不同的是塌缩点还得x2.",
    "想知道为什么反塌缩点的加成是^0.6而不是平方根么?2^0.6=1.51,2*1.51约等于3.",
]
function changeRl4Tip(){
    if(!player.mirrorize) w("rl4Tip",
        `Tip:打破镜面会导致塌缩层级产生一系列变化.<br> 
        1.解开e20000的物质硬上限<br>
        2.禁用第五排塌缩升级<br>
        3.部分挑战重平衡(暂未平衡)<br>
        4.解锁反塌缩点,反塌缩点基于塌缩点获取量在塌缩时获得.反塌缩点^0.6倍增塌缩点.<br>
        5.塌缩点倍增器效果变为其平方根.<br>
        6.部分软上限被修改.
        7.如果你购买了cu42,打破无限.`
        )
    else w("rl4Tip","Tip:"+rl4Tips[Math.floor(Math.random()*rl4Tips.length)])
}